nxp-mcuxpresso/mcux-sdk/devices/MKM34ZA5/drivers/fsl_clock.h
/*! @brief Clock ip name array for PDB. */
#define PDB_CLOCKS  \
    {               \
        kCLOCK_Pdb0 \
    }

/*! @brief Clock ip name array for FTF. */
#define FTF_CLOCKS  \
    {               \
        kCLOCK_Ftf0 \
    }

/*! @brief Clock ip name array for CMP. */
#define CMP_CLOCKS               \
    {                            \
        kCLOCK_Cmp0, kCLOCK_Cmp1 \
    }

/*!
 * @brief LPO clock frequency.
 */
#define LPO_CLK_FREQ 1000U

/*! @brief Peripherals clock source definition. */
#define SYS_CLK kCLOCK_CoreSysClk
#define BUS_CLK kCLOCK_BusClk

#define I2C0_CLK_SRC  BUS_CLK
#define I2C1_CLK_SRC  BUS_CLK
#define SPI0_CLK_SRC  SYS_CLK
#define SPI1_CLK_SRC  SYS_CLK
#define UART0_CLK_SRC BUS_CLK
#define UART1_CLK_SRC SYS_CLK
#define UART2_CLK_SRC BUS_CLK
#define UART3_CLK_SRC SYS_CLK

/*! @brief Clock name used to get clock frequency. */
typedef enum _clock_name
{

    /* ----------------------------- System layer clock -------------------------------*/
    kCLOCK_CoreSysClk, /*!< Core/system clock                                         */
    kCLOCK_PlatClk,    /*!< Platform clock                                            */
    kCLOCK_BusClk,     /*!< Bus clock                                                 */
    kCLOCK_FlashClk,   /*!< Flash clock                                               */

    /* ---------------------------------- OSC clock -----------------------------------*/
    kCLOCK_Er32kClk,  /*!< External reference 32K clock (ERCLK32K)                   */
    kCLOCK_Osc0ErClk, /*!< OSC0 external reference clock (OSC0ERCLK)                 */

    /* ----------------------------- MCG and MCG-Lite clock ---------------------------*/
    kCLOCK_McgFixedFreqClk,   /*!< MCG fixed frequency clock (MCGFFCLK)                      */
    kCLOCK_McgInternalRefClk, /*!< MCG internal reference clock (MCGIRCLK)                   */
    kCLOCK_McgFllClk,         /*!< MCGFLLCLK                                                 */
    kCLOCK_McgPll0Clk,        /*!< MCGPLL0CLK                                                */
    kCLOCK_McgExtPllClk,      /*!< EXT_PLLCLK                                                */
    kCLOCK_McgPeriphClk,      /*!< MCG peripheral clock (MCGPCLK)                            */

    /* --------------------------------- Other clock ----------------------------------*/
    kCLOCK_LpoClk, /*!< LPO clock                                                 */

} clock_name_t;

/*------------------------------------------------------------------------------

 clock_gate_t definition:

 31                              16                              0
 -----------------------------------------------------------------
 | SIM_SCGC register offset       |   control bit offset in SCGC |
 -----------------------------------------------------------------

 For example, the SDHC clock gate is controlled by SIM_SCGC3[17], the
 SIM_SCGC3 offset in SIM is 0x1030, then kClockGateSdhc0 is defined as

              kClockGateSdhc0 = (0x1030 << 16) | 17;

------------------------------------------------------------------------------*/

#define CLK_GATE_REG_OFFSET_SHIFT 16U
#define CLK_GATE_REG_OFFSET_MASK  0xFFFF0000U
#define CLK_GATE_BIT_SHIFT_SHIFT  0U
#define CLK_GATE_BIT_SHIFT_MASK   0x0000FFFFU

#define CLK_GATE_DEFINE(reg_offset, bit_shift)                                  \
    ((((reg_offset) << CLK_GATE_REG_OFFSET_SHIFT) & CLK_GATE_REG_OFFSET_MASK) | \
     (((bit_shift) << CLK_GATE_BIT_SHIFT_SHIFT) & CLK_GATE_BIT_SHIFT_MASK))

#define CLK_GATE_ABSTRACT_REG_OFFSET(x) (((x)&CLK_GATE_REG_OFFSET_MASK) >> CLK_GATE_REG_OFFSET_SHIFT)
#define CLK_GATE_ABSTRACT_BITS_SHIFT(x) (((x)&CLK_GATE_BIT_SHIFT_MASK) >> CLK_GATE_BIT_SHIFT_SHIFT)

/*! @brief Clock gate name used for CLOCK_EnableClock/CLOCK_DisableClock. */
typedef enum _clock_ip_name
{
    kCLOCK_IpInvalid = 0U,
    kCLOCK_Ewm0      = CLK_GATE_DEFINE(0x1034U, 1U),
    kCLOCK_Mcg       = CLK_GATE_DEFINE(0x1034U, 4U),
    kCLOCK_Osc       = CLK_GATE_DEFINE(0x1034U, 6U),
    kCLOCK_I2c0      = CLK_GATE_DEFINE(0x1034U, 7U),
    kCLOCK_I2c1      = CLK_GATE_DEFINE(0x1034U, 8U),
    kCLOCK_Uart0     = CLK_GATE_DEFINE(0x1034U, 10U),
    kCLOCK_Uart1     = CLK_GATE_DEFINE(0x1034U, 11U),
    kCLOCK_Uart2     = CLK_GATE_DEFINE(0x1034U, 12U),
    kCLOCK_Uart3     = CLK_GATE_DEFINE(0x1034U, 13U),
    kCLOCK_Vref0     = CLK_GATE_DEFINE(0x1034U, 15U),
    kCLOCK_Cmp0      = CLK_GATE_DEFINE(0x1034U, 18U),
    kCLOCK_Cmp1      = CLK_GATE_DEFINE(0x1034U, 19U),
    kCLOCK_Spi0      = CLK_GATE_DEFINE(0x1034U, 21U),
    kCLOCK_Spi1      = CLK_GATE_DEFINE(0x1034U, 22U),

    kCLOCK_Slcd0  = CLK_GATE_DEFINE(0x1038U, 3U),
    kCLOCK_PortA  = CLK_GATE_DEFINE(0x1038U, 6U),
    kCLOCK_PortB  = CLK_GATE_DEFINE(0x1038U, 7U),
    kCLOCK_PortC  = CLK_GATE_DEFINE(0x1038U, 8U),
    kCLOCK_PortD  = CLK_GATE_DEFINE(0x1038U, 9U),
    kCLOCK_PortE  = CLK_GATE_DEFINE(0x1038U, 10U),
    kCLOCK_PortF  = CLK_GATE_DEFINE(0x1038U, 11U),
    kCLOCK_PortG  = CLK_GATE_DEFINE(0x1038U, 12U),
    kCLOCK_PortH  = CLK_GATE_DEFINE(0x1038U, 13U),
    kCLOCK_PortI  = CLK_GATE_DEFINE(0x1038U, 14U),
    kCLOCK_Rtc0   = CLK_GATE_DEFINE(0x1038U, 16U),
    kCLOCK_Rtcreg = CLK_GATE_DEFINE(0x1038U, 17U),
    kCLOCK_Wdog   = CLK_GATE_DEFINE(0x1038U, 19U),
    kCLOCK_Xbar   = CLK_GATE_DEFINE(0x1038U, 21U),
    kCLOCK_Tmr0   = CLK_GATE_DEFINE(0x1038U, 23U),
    kCLOCK_Tmr1   = CLK_GATE_DEFINE(0x1038U, 24U),
    kCLOCK_Tmr2   = CLK_GATE_DEFINE(0x1038U, 25U),
    kCLOCK_Tmr3   = CLK_GATE_DEFINE(0x1038U, 26U),

    kCLOCK_Ftf0    = CLK_GATE_DEFINE(0x103CU, 0U),
    kCLOCK_Dmamux0 = CLK_GATE_DEFINE(0x103CU, 1U),
    kCLOCK_Dmamux1 = CLK_GATE_DEFINE(0x103CU, 2U),
    kCLOCK_Dmamux2 = CLK_GATE_DEFINE(0x103CU, 3U),
    kCLOCK_Dmamux3 = CLK_GATE_DEFINE(0x103CU, 4U),
    kCLOCK_Rnga0   = CLK_GATE_DEFINE(0x103CU, 9U),
    kCLOCK_Adc0    = CLK_GATE_DEFINE(0x103CU, 11U),
    kCLOCK_Pit0    = CLK_GATE_DEFINE(0x103CU, 13U),
    kCLOCK_Pit1    = CLK_GATE_DEFINE(0x103CU, 14U),
    kCLOCK_Afe0    = CLK_GATE_DEFINE(0x103CU, 16U),
    kCLOCK_Crc0    = CLK_GATE_DEFINE(0x103CU, 20U),
    kCLOCK_Lptmr0  = CLK_GATE_DEFINE(0x103CU, 28U),
    kCLOCK_SimLp   = CLK_GATE_DEFINE(0x103CU, 30U),
    kCLOCK_SimHp   = CLK_GATE_DEFINE(0x103CU, 31U),

